In [1]:
import pandas as pd

In [6]:
india_weather = pd.DataFrame({
    "city": ["mumbai", "delhi", "bangalore"],
    "temperature": [34,30,40],
    "humidity": [80,60,58]
})

In [7]:
india_weather

        city  temperature  humidity
0     mumbai           34        80
1      delhi           30        60
2  bangalore           40        58

In [8]:
usa_weather = pd.DataFrame({
    "city": ["nee york", "chicago", "orlando"],
    "temperature": [21,14,35],
    "humidity": [68,65,75]
})

In [9]:
usa_weather

       city  temperature  humidity
0  nee york           21        68
1   chicago           14        65
2   orlando           35        75

In [11]:
df = pd.concat([india_weather, usa_weather])

In [12]:
df

        city  temperature  humidity
0     mumbai           34        80
1      delhi           30        60
2  bangalore           40        58
0   nee york           21        68
1    chicago           14        65
2    orlando           35        75

In [13]:
df = pd.concat([india_weather, usa_weather], ignore_index=True)

In [14]:
df

        city  temperature  humidity
0     mumbai           34        80
1      delhi           30        60
2  bangalore           40        58
3   nee york           21        68
4    chicago           14        65
5    orlando           35        75

In [15]:
df = pd.concat([india_weather, usa_weather], keys=["india", "usa"])

In [16]:
df

              city  temperature  humidity
india 0     mumbai           34        80
      1      delhi           30        60
      2  bangalore           40        58
usa   0   nee york           21        68
      1    chicago           14        65
      2    orlando           35        75

In [17]:
df.loc["india"]

        city  temperature  humidity
0     mumbai           34        80
1      delhi           30        60
2  bangalore           40        58

In [18]:
india_temp = pd.DataFrame({
    "city": ["mumbai", "delhi", "bangalore"],
    "temperature": [34,30,40],
    
})

In [19]:
india_temp

        city  temperature
0     mumbai           34
1      delhi           30
2  bangalore           40

In [20]:
india_windspeed = pd.DataFrame({
    "city": ["mumbai", "delhi", "bangalore"],
    "windspeed": [8,12,6],
    
})

In [21]:
india_windspeed

        city  windspeed
0     mumbai          8
1      delhi         12
2  bangalore          6

In [24]:
df = pd.concat([india_temp, india_windspeed], axis=1)

In [25]:
df

        city  temperature       city  windspeed
0     mumbai           34     mumbai          8
1      delhi           30      delhi         12
2  bangalore           40  bangalore          6

In [27]:
india_temp = pd.DataFrame({
    "city": ["mumbai", "delhi", "bangalore"],
    "temperature": [34,30,40],
    
}, index=[0,1,2])
india_temp

        city  temperature
0     mumbai           34
1      delhi           30
2  bangalore           40

In [31]:
india_windspeed = pd.DataFrame({
    "city": ["delhi", "mumbai"],
    "windspeed": [12, 8],
    
}, index=[1,0])
india_windspeed

     city  windspeed
1   delhi         12
0  mumbai          8

In [34]:
df = pd.concat([india_temp, india_windspeed], axis=1)

In [35]:
df

        city  temperature    city  windspeed
0     mumbai           34  mumbai        8.0
1      delhi           30   delhi       12.0
2  bangalore           40     NaN        NaN

In [36]:
india_temp

        city  temperature
0     mumbai           34
1      delhi           30
2  bangalore           40

In [38]:
s = pd.Series(["rain", "dry", "humid"], name="event")
s

0     rain
1      dry
2    humid
Name: event, dtype: object

In [39]:
df = pd.concat([india_temp, s], axis=1)

In [40]:
df

        city  temperature  event
0     mumbai           34   rain
1      delhi           30    dry
2  bangalore           40  humid